### 1. mysql(mariaDB) 연결

In [1]:
#cmd키고 pip install pymysql 설치하기

In [2]:
# PANDAS 패키지 불러오기 (mysql 불러올때)
import pandas as pd
import pymysql
from sqlalchemy import create_engine

# DB 커넥션 열기
engine = create_engine('mysql+pymysql://kopo:kopo@192.168.110.111:3306/kopo')

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query('SELECT * FROM mysql_yoorim', engine)
selloutData.head(5)

# # 컬럼헤더 재정의
# selloutData.columns = ['종선','수찬','ㅇㄹ','ㅎㅅ']

# # 데이터 저장
# resultname='mysql_hs'
# selloutData.to_sql (resultname, engine, if_exists='replace', index= False)

    종선      수찬      형섭      유림
0  A01  ST0002  201512  151750
1  A01  ST0001  201520  645626
2  A01  ST0002  201520  125863
3  A01  ST0001  201515  810144
4  A01  ST0002  201515  128999

In [3]:
# PANDAS 패키지 불러오기
import pandas as pd
import pymysql
from sqlalchemy import create_engine

# DB 커넥션 열기
engine = create_engine('mysql+pymysql://root:root@192.168.110.9:3306/형섭1') #나의 마리아db(heidisql)

# engine = create_engine('mysql+pymysql://아이디:비밀번호@ip:포트번호/DB이름')

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query('SELECT * FROM 형섭1info', engine)

# 컬럼헤더 재정의
#selloutData.columns =['~','~','~']

# 데이터 저장
resultname='mysql_hs'
selloutData.to_sql (resultname, engine, if_exists='replace', index= False)

### 2. 오라클(toad) 연결

In [4]:
#cmd키고 pip install cx_Oracle 설치하기

In [5]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://system:manager@192.168.110.9:1522/xe') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine) 
selloutData.head()
# # 컬럼해더 재정의
# selloutData.columns = ['REGIONID','PRODUCTGROUP','YEARWEEK','VOLUME']

# # 데이터 VIEW
# print(selloutData.head())

# # 데이터 저장
# resultname='oracleresult'
# selloutData.to_sql(resultname, engine, if_exists='replace', index=False)

  regionid productgroup yearweek  volume
0      A01       ST0001   201501    1000
1      A02       ST0001   201405      10
2      A03       ST0003   201502    1000

### 3. Postgres 연결

In [6]:
#cmd키고 pip install psycopg2 설치하기

In [7]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('postgresql://kopo:kopo@192.168.110.111:5432/kopo') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine) 

selloutData.head()

  regionid productgroup yearweek  volume
0      A01       ST0002   201512  151750
1      A01       ST0002   201520  125863
2      A01       ST0002   201515  128999
3      A01       ST0002   201518  134467
4      A01       ST0002   201513  140297

### 4. 실습(MySQL DB에 접속하여 조회 후 컬럼이름 변경)

In [15]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('postgresql://kopo:kopo@192.168.110.111:5432/kopo') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine) 

# 컬럼해더 재정의
selloutData.columns = ['REGIONID','PRODUCTGROUP','YEARWEEK','VOLUME']
selloutData.head(5)

# 데이터 저장
resultname='seobb'
selloutData.to_sql(resultname, engine, if_exists='replace', index=False)

### 5. 파이썬 - 문법 & 데이터 불러오기 퀴즈

In [9]:
import pandas as pd
import psycopg2
import pymysql
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://kopo:kopo@13.209.112.251:3306/kopo')

selloutData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine)

selloutData.columns =['AA','BB','CC','DD']

engine_postgres = create_engine('postgresql://kopo:kopo@192.168.110.111:5432/kopo')

resultname='kopo_product_volume_이형섭'
selloutData.to_sql (resultname, engine, if_exists='replace', index= False)

In [12]:
selloutData.head(5)

  regionid productgroup yearweek    volume
0      A01       ST0002   201512  151750.0
1      A01       ST0001   201520  645626.0
2      A01       ST0002   201520  125863.0
3      A01       ST0001   201515  810144.0
4      A01       ST0002   201515  128999.0

### 파이썬 퀴즈 mysql에있는 파일을 이름바꿔서 postgres에 저장하기

In [16]:
# PANDAS 패키지 불러오기 (mysql 불러올때)
import pandas as pd
import pymysql
from sqlalchemy import create_engine

# DB 커넥션 열기
engine = create_engine('mysql+pymysql://kopo:kopo@13.209.112.251:3306/kopo')
selloutData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine)

engine_postgres = create_engine('postgresql://haiteam:haiteam@13.209.112.251:5432/postgres')

resultname='quiz_이형섭'
selloutData.to_sql(resultname, engine_postgres, if_exists='replace', index= False)